export const audioBaseUrl = 'http://www.cosmicconsultancy.com/tamilappaudio';

export const mainWords = [
  {
    wordId: 1,
    tamilWord: 'வரிக்குதிரை',
    engWord: 'Zebra',
    pronounceText: 'வரி க் குதி ரை',
    phonetics: '/ʋəɾɪkkʉt̪ɪɾəj/',
    image: require('../../assets/images/temp/zebra.jpg'),
    audioUri: audioBaseUrl + '/word_varikkuthirai.mp3',
    explanation: [
      'உடலில் கறுப்பு, வெள்ளைப் பட்டைகளை உடைய குதிரைக் குடும்பத்தைச் சேர்ந்த (ஆப்பிரிக்கக் கண்டத்தில்  பரவலாகக் காணப்படும்) விலங்கு.'
    ],
    learning: ['வரிக்குதிரை மிகவும் அழகான மிருகம்.'],
    origin: [
      'ஆப்பிரிக்காவை பூர்விகமாகக்கொண்டது வரிக்குதிரை. இது பாலூட்டி இனத்தைச் சேர்ந்த ஒரு விலங்கு ஆகும். இது ஒரு தாவர உண்ணி. இது குதிரை இனத்தைச் சேர்ந்தது. உடல்முழுவதும் வரிகளாக இருப்ப‍தால் இது வரிக்குதிரை என்றே அழைக்கப்படுகிறது. இந்த வரிக்குதிரை தமிழ்நாட்டைச் சேர்ந்த விலங்கினம் கிடையாது என்பர். தமிழ் இலக்கியத்தில் குதிரைக்கு பலவிதமான பெயர்கள் உள்ளன. இரண்டு வார்த்தைகளின் உருவாக்கம்தான் வரிக்குதிரை. வரி எனறால் ‘strip’ or ‘line’, குதிரை என்றால் ‘horse’ ஆகவே இது வரிக்குதிரை ‘zebra’ என்றழைக்கப்படுகிறது.'
    ],
    date: '23 Feb',
    likes: 0
  },
  {
    wordId: 2,
    tamilWord: 'தடுப்பூசி',
    engWord: 'Vaccine',
    pronounceText: 'தடுப்·பூசி',
    phonetics: '/t̪əɖʉppuːsɪ/',
    image: require('../../assets/images/temp/injection.jpg'),
    audioUri: audioBaseUrl + '/word_thaduppuuci.mp3',
    explanation: [
      'நோய் வராமல் தடுக்கும் பொருட்டு முன்னெச்சரிக்கையாகப் போடப்படும் ஊசி.'
    ],
    learning: ['குழந்தைகளுக்கு அம்மைத் தடுப்பூசி போடவேண்டும்.'],
    origin: [
      'தடுப்பூசி அம்மை நோயை தடுப்பதற்காக பயன்படுத்தும் ஒருவகை மருந்தாகும். ஆங்கிலத்தில் Vaccination என்பர். இவ்வம்மை நோயிக்கு நாட்டுமருந்து கொடுத்தால்கூட குணமாகும். ஆங்கில மருத்துவத்தில் எல்லா Vaccination-னும் ஊசியின் மூலம்தான் செய்யப்படுகிறது. அதற்கு  தமிழறிஞர்கள் உருவாக்கிய சொல்தான் தடுப்பூசி. இந்த தடுப்பூசியின் நோக்கம் நோயைத் தடுப்பது. ஆகவே தமிழில் தடுப்பு என்றால் prevention or stopping என்று அர்த்தம். Vaccination ஊசியின் மூலம் போடுவதால். இதற்கு தமிழ் சொல் தடுப்பூசி = தடுப்பு + ஊசி for vaccineation தடுப்பூசி என்றழைக்கப்படுகிறது.'
    ],
    date: '27 Feb',
    likes: 0
  },
  {
    wordId: 3,
    tamilWord: 'நாடாளுமன்றம்',
    engWord: 'Parliament',
    pronounceText: 'நாடாளு·மன்றம்',
    phonetics: '/nɑːɖɑːɭʉməɳɖrəm/',
    image: require('../../assets/images/temp/assembly.jpg'),
    audioUri: audioBaseUrl + '/word_naadaalumandram.mp3',
    explanation: [
      '(இந்தியாவில்) மக்களவையையும் மாநிலங்களவையையும் குறிக்கும் பொதுப்பெயர்.'
    ],
    learning: ['வநாடாளுமன்றத்தின் இரு அவைகளிலும் இன்று அமளி நிலவியது. '],
    origin: [
      'ஒரு தேசத்தை அல்லது ஒரு நாட்டை ஆளக்கூடிய மன்றமாக இருப்பதற்கு நாடாளுமன்றம் என்று தமிழில் அழைப்பர். "நாடு" என்றால் country என்றும், "ஆளும்" என்றால் govern என்றும், மன்றம் என்றால் group  or club என்று பொருள். ஆக, நாடாளுமன்றம் என்றால் group that governs the country நாட்டை அளுகின்ற மன்றம் நாடாளுமன்றம் எனப்பட்டது.'
    ],
    date: '25 Feb',
    likes: 0
  },
  {
    wordId: 4,
    tamilWord: 'பல்கலைக்கழகம்',
    engWord: 'University',
    pronounceText: 'பல்·கலைக்·கழகம்',
    phonetics: '/pəlgaləjkkəɻəgam/',
    image: require('../../assets/images/temp/university.jpg'),
    audioUri: audioBaseUrl + '/word_palkalaikazhagam.mp3',
    explanation: [
      'தேர்வுகள் நடத்துதல், பட்டப் படிப்பு வகுப்புகள் நடத்துதல் போன்ற பணிகளைச் செய்வதும் ஆராய்ச்சி  மையமாக விளங்குவதுமான உயர் கல்வி நிறுவனம்.'
    ],
    learning: ['தமிழ்ப் பல்கலைக்கழகம் தஞ்சாவூரில் அமைந்துள்ளது.'],
    origin: [
      'முதன் முதல் இந்தியாவில் புத்தர் தான் நளந்தா கல்விச் சாலையை பல்கலைக்கழகமாக அழைத்தனர். 1950-க்கு முன்தான் "university-யை" சர்வகலாசாலா என்று வடமொழி சொல்லைப் பயன்படுத்தி வந்தனர். அதை சர்வ என்றால் "all" என்றும், கலா என்றால் "arts" என்றும், சாலா என்றால் institution or institute என்றும்  அழைத்தனர். இந்த வடமொழிச் சொல்லை தமிழ் அறிஞர்கள் பல்கலைக்கழகம் என்ற தூய தமிழ்ச் சொல்லாக அறிமுகப்படுத்தினர். பல் என்றால் many என்றும், கலை என்றால் arts என்றும், கழகம் என்றால் group or  organization என்று இருந்த தனிச்சொற்களைக்  கூட்டுச்சொல்லாக  பல்கலைக்கழகம் என்று அழைத்தனர். சர்வகலாசாலை என்ற வார்த்தை போய் இன்று university or பல்கலைக்கழகம் என்று மறுவியது.'
    ],
    date: '26 Feb',
    likes: 0
  },
  {
    wordId: 5,
    tamilWord: 'வான்கோழி',
    engWord: 'Turkey',
    pronounceText: 'வான்·கோழி',
    phonetics: '/ʋɑːnkoːɻɪ/',
    image: require('../../assets/images/temp/turkey.jpg'),
    audioUri: audioBaseUrl + '/word_vaankozhi.mp3',
    explanation: [
      'தலையின் மேற்பகுதியில் சேவலுக்கு இருப்பதுபோல் கொண்டையும் நீண்டிருக்கும் கழுத்துப் பகுதியில்  தொங்கும் சதையும் உடைய (தோகை விரித்து ஆடும்) ஒரு பறவை; Turkey.'
    ],
    learning: [
      'வான்கோழி தரையில் வசிக்கும் பறவையினத்தைச் சேர்ந்த உயிரினமாகும்.'
    ],
    origin: [
      'வான்கோழி இனம் அமெரிக்காவின் பூர்வீகம். ஆங்கிலத்தில் டர்க்கி (Turkey) என்று அழைக்கப்படுகிறது. வான்கோழிக்கும் துருக்கி நாட்டுக்கும் (Turkey)  எந்த சம்பந்தமும் இல்லை. ஆனால், துருக்கி நாட்டு  வியாபாரிகள் இவற்றை லண்டனில் விற்றதால் இவை துருக்கி கோழிகள் என்றழைக்கப்பட்டன. ஒவையார்கூட மூதுரையில் வான்கோழியின் தன்மையைக் கல்லாதவனுக்கு ஒப்பிடுகிறார். இவ்வான்கோழியைப் பல்வேறு நாட்டில் வர்த்தகர்களால் வர்த்தகம் செய்துள்ளனர். இதனால், தமிழர்கள் இதை வான்கோழி  என்றழைத்தனர். இதுவும் இரண்டு வார்த்தைகளின் உருவாக்கம் ஆகும். வான்--> வனம் means ‘jungle’ or ‘forest’ எனவும், கோழி means ‘chicken’ எனவும் ஆகவே இது வான்கோழி என்றழைக்கப்படுகிறது.'
    ],
    date: '24 Feb',
    likes: 0
  },
  {
    wordId: 6,
    tamilWord: 'நுழைவுச்சீட்டு',
    engWord: 'Ticket',
    pronounceText: 'நுழை·வுச் சீட்டு',
    phonetics: '/nʉɻəjʋʉtʃ tʃiːʈʈʉ/',
    image: require('../../assets/images/temp/ticket.jpg'),
    audioUri: audioBaseUrl + '/word_nulaivuchittu.mp3',
    explanation: [
      '(கட்டுப்பாடுகள் இருக்கும்) ஒர் இடத்தில் உள்ளே செல்லுவதற்கு அணுமதி அளித்து அதிகாரபூர்வமாக  வழங்கப்படும் சீட்டு entry pass.'
    ],
    learning: [
      'நுழைவுச் சீட்டு உள்ளவர்கள் மட்டுமே அணுமின் நிலையத்தினுள் அனுமதிக்கப்படுவார்கள்.'
    ],
    origin: [
      'நுழைவுச் சீட்டை கடவு சீட்டு என்றும் அழைப்பர். ஒரு இடத்தை விட்டு கடந்து போவதைக் கடவு என்று அழைத்தான். அதற்கு அனுமதி தேவைப்பட்டது. அதனால் கடவு சீட்டு அல்லது நுழைவுச்சீட்டு என்று பெயர்வைத்தான். நுழைவு means "entry", சீட்டு means "paper or card". ஆகவே Visa என்றால் நுழைவு  சீட்டு என்றழைக்கப்படுகிறது. ஒரு நாட்டில் மற்ற நாட்டினர் உள்ளே நுழைவதற்கு அனுமதி பெறுவதுதான்  நுழைவுச்சீட்டு என்பர். இந்த நுழைவுச்சீட்டு தேர்வுகளுக்கு, பயணத்திற்கு, விடுதிகளுக்கு,  இணையத்திற்கு, கணினிக்கு இன்னும் பிறவற்றிற்கும் பயன்படுத்தி வருகின்றனர்.'
    ],
    date: '28 Feb',
    likes: 0
  }
];

export const favorites = [];
export const history = [4, 2, 1, 3];
export const trending = [2, 4, 6];

export const searchWords = [
  {
    wordId: 1,
    tamilWord: 'வரிக்குதிரை'
  },
  {
    wordId: 2,
    tamilWord: 'வான்கோழி'
  },
  {
    wordId: 3,
    tamilWord: 'நாடாளுமன்றம்'
  },
  {
    wordId: 4,
    tamilWord: 'பல்கலைக்கழகம்'
  },
  {
    wordId: 5,
    tamilWord: 'தடுப்பூசி'
  },
  {
    wordId: 6,
    tamilWord: 'நுழைவுச்சீட்டு'
  }
];

export const wordOfTheDay = [1, 2, 3, 4, 5];
